# Solución Examen UD1 - Parte 2

Si tenemos un dataframe df con columnas age, salary, sex y queremos:

1. Mostrar aquellos individuos menores de 30 años o con salario igual o superior a 25000 euros,

2. Añadir una nueva columna numérica al dataframe llamada salary_irpf que se corresponda con el 20% de su sueldo, entonces escribiremos:


3. Si tenemos un dataframe df con columnas age, salary, sex y queremos saber cuél es la media de edad de nuestros individuos, entonces escribiremos:


4. Si tenemos un dataframe df con columnas age, salary, sex y queremos borrar del mismo la columna sex, entonces escribiremos:


5. Si tenemos un dataframe df con columnas age, salary, sex y queremos conocer el salario máximo por sexo, entonces escribiremos:


6. Si tenemos un dataframe df con columnas age, salary, sex y queremos recuperar las 3 primeras filas y las 3 últimas de la columna salary en una única instrucción, entonces escribiremos:

7. Si tenemos un dataframe df con columnas age, salary, sex y queremos añadir borrar todas las filas que tengan valores nulos en la columna salary, entonces escribiremos:

In [39]:
import pandas as pd

df_work_data=pd.read_csv("data/demo-examen-parte2.csv")
df_work_data.head(10)

   age  salary     sex
0   58   36000    male
1   23   18000  female
2   31   23000  female
3   28   40000  female
4   46   50000    male
5   18   15000    male
6   38   38000  female
7   40   29000    male

In [40]:
df_work_data[(df_work_data.salary >=25000) & (df_work_data.age <30)]

   age  salary     sex
3   28   40000  female

In [41]:
#Aquí le ponemos la nueva columna (salary_irpf) añadiendole el 20% del valor del salario
df_work_data = df_work_data.assign(salary_irpf = lambda x: (x['salary'] * 0.20))

In [42]:
df_work_data

   age  salary     sex  salary_irpf
0   58   36000    male       7200.0
1   23   18000  female       3600.0
2   31   23000  female       4600.0
3   28   40000  female       8000.0
4   46   50000    male      10000.0
5   18   15000    male       3000.0
6   38   38000  female       7600.0
7   40   29000    male       5800.0

In [43]:
df_work_data['age'].mean()

35.25

In [44]:
df_work_data.drop(columns="sex",axis=1)

   age  salary  salary_irpf
0   58   36000       7200.0
1   23   18000       3600.0
2   31   23000       4600.0
3   28   40000       8000.0
4   46   50000      10000.0
5   18   15000       3000.0
6   38   38000       7600.0
7   40   29000       5800.0

In [45]:
df_work_data.groupby('sex').mean()

         age   salary  salary_irpf
sex
female  30.0  29750.0       5950.0
male    40.5  32500.0       6500.0

In [46]:
df_concatenado = pd.concat([df_work_data.head(3), df_work_data.tail(3)])

In [47]:
df_concatenado

   age  salary     sex  salary_irpf
0   58   36000    male       7200.0
1   23   18000  female       3600.0
2   31   23000  female       4600.0
5   18   15000    male       3000.0
6   38   38000  female       7600.0
7   40   29000    male       5800.0

In [48]:
df_work_data.dropna(subset="salary")

   age  salary     sex  salary_irpf
0   58   36000    male       7200.0
1   23   18000  female       3600.0
2   31   23000  female       4600.0
3   28   40000  female       8000.0
4   46   50000    male      10000.0
5   18   15000    male       3000.0
6   38   38000  female       7600.0
7   40   29000    male       5800.0